#+title: Database
* Schema
#+begin_src sqlite :db instance/test.sqlite :colnames yes
drop table if exists 'users';
drop table if exists 'videos';
drop table if exists 'pathToUrls';

create table pathToUrls (
  'id' integer primary key autoincrement,
  'path' text not null,
  'url' text not null
);
#+end_src

#+RESULTS:

* TestData
** Schema pathToUrls
#+begin_src sqlite :db instance/test.sqlite :colnames yes
.schema pathToUrls
#+end_src

#+RESULTS:
| CREATE TABLE pathToUrls (              |   |
|----------------------------------------+---|
| 'id' integer primary key autoincrement |   |
| 'path' text not null                   |   |
| 'url' text not null                    |   |
| );                                     |   |
** insert test data
#+begin_src sqlite :db instance/test.sqlite :colnames yes
insert into pathToUrls ('path', 'url') values
            ('/urlshort', 'https://github.com/gophercises/urlshort'),
            ('/urlshort-final', 'https://github.com/gophercises/urlshort/tree/solution');
#+end_src
** get test data
#+begin_src sqlite :db instance/test.sqlite :colnames yes
select * from pathToUrls
#+end_src

#+RESULTS:
| id | path            | url                                                   |
|----+-----------------+-------------------------------------------------------|
|  1 | /urlshort       | https://github.com/gophercises/urlshort               |
|  2 | /urlshort-final | https://github.com/gophercises/urlshort/tree/solution |
